In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [13]:
%%sql
USE employees;

 * mysql://root:***@localhost/employees
0 rows affected.

[]

In [19]:
#MySQL triggers exercise 1

In [20]:
%%sql
USE employees;

COMMIT;

 * mysql://root:***@localhost/employees
0 rows affected.
0 rows affected.

[]

In [27]:
%%sql
DROP TRIGGER IF EXISTS before_salaries_insert;

CREATE TRIGGER before_salaries_insert
BEFORE INSERT ON salaries
FOR EACH ROW
BEGIN
	IF NEW.salary <0 THEN
		SET NEW.salary = 0;
	END IF;
END;

 * mysql://root:***@localhost/employees
0 rows affected.
0 rows affected.

[]

In [29]:
%%sql
SELECT *
FROM salaries
WHERE emp_no = '10001';

INSERT INTO salaries VALUES ('10001',-9282,'2016-06-22','9999-01-01');

 * mysql://root:***@localhost/employees
18 rows affected.
(MySQLdb.IntegrityError) (1062, "Duplicate entry '10001-2016-06-22' for key 'salaries.PRIMARY'")
[SQL: INSERT INTO salaries VALUES ('10001',-9282,'2016-06-22','9999-01-01');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [31]:
%%sql
SELECT *
FROM salaries
WHERE emp_no = '10001';

 * mysql://root:***@localhost/employees
18 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26)),
 (10001, 62102, datetime.date(1987, 6, 26), datetime.date(1988, 6, 25)),
 (10001, 66074, datetime.date(1988, 6, 25), datetime.date(1989, 6, 25)),
 (10001, 66596, datetime.date(1989, 6, 25), datetime.date(1990, 6, 25)),
 (10001, 66961, datetime.date(1990, 6, 25), datetime.date(1991, 6, 25)),
 (10001, 71046, datetime.date(1991, 6, 25), datetime.date(1992, 6, 24)),
 (10001, 74333, datetime.date(1992, 6, 24), datetime.date(1993, 6, 24)),
 (10001, 75286, datetime.date(1993, 6, 24), datetime.date(1994, 6, 24)),
 (10001, 75994, datetime.date(1994, 6, 24), datetime.date(1995, 6, 24)),
 (10001, 76884, datetime.date(1995, 6, 24), datetime.date(1996, 6, 23)),
 (10001, 80013, datetime.date(1996, 6, 23), datetime.date(1997, 6, 23)),
 (10001, 81025, datetime.date(1997, 6, 23), datetime.date(1998, 6, 23)),
 (10001, 81097, datetime.date(1998, 6, 23), datetime.date(1999, 6, 23)),
 (10001, 84917, datetime.date(1999, 6, 23), datetime.date(2000, 6, 22)),
 (10001, 85112, datetime.date(2000, 6, 22), datetime.date(2001, 6, 22)),
 (10001, 85097, datetime.date(2001, 6, 22), datetime.date(2002, 6, 22)),
 (10001, 88958, datetime.date(2002, 6, 22), datetime.date(9999, 1, 1)),
 (10001, 0, datetime.date(2016, 6, 22), datetime.date(9999, 1, 1))]

In [32]:
#MySQL triggers exercise 2

In [34]:
%%sql
CREATE TRIGGER before_salaries_insert_2
BEFORE INSERT ON salaries
FOR EACH ROW
BEGIN
	IF NEW.salary <0 THEN
		SET NEW.salary = OLD.salary;
	END IF;
END;

 * mysql://root:***@localhost/employees
(MySQLdb.OperationalError) (1363, 'There is no OLD row in on INSERT trigger')
[SQL: CREATE TRIGGER before_salaries_insert_2
BEFORE INSERT ON salaries
FOR EACH ROW
BEGIN
	IF NEW.salary <0 THEN
		SET NEW.salary = OLD.salary;
	END IF;
END;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql
UPDATE salaries
SET salary = 98765
WHERE emp_no = '10001'
AND from_date ='2016-06-22';

 * mysql://root:***@localhost/employees
1 rows affected.

[]

In [38]:
%%sql
SELECT *
FROM salaries
WHERE emp_no = '10001'
AND from_date ='2016-06-22';

 * mysql://root:***@localhost/employees
1 rows affected.

[(10001, 98765, datetime.date(2016, 6, 22), datetime.date(9999, 1, 1))]

In [ ]:
#trigger exercise 3
#create a trigger that will apply several modifications to the "salaries" table once the relevant record in the "department manager" table has been inserted.

In [40]:
%%sql
/*
DELIMITER $$

CREATE TRIGGER trig_ins_dept_mng
AFTER INSERT ON dept_manager
FOR EACH ROW
BEGIN
DECLARE v_curr_salary int;
SELECT 
    MAX(salary)
INTO v_curr_salary FROM
    salaries
WHERE
    emp_no = NEW.emp_no;

IF v_curr_salary IS NOT NULL THEN
UPDATE salaries
SET
to_date = SYSDATE()
WHERE emp_no = NEW.emp_no and to_date=NEW.to_date;

INSERT INTO salaries
VALUES(NEW.emp_no,v_curr_salary +2000, NEW.from_date, NEW.to_date);
END IF;

END
$$
*/

 * mysql://root:***@localhost/employees
0 rows affected.

[]

In [43]:
%%sql
SET FOREIGN_KEY_CHECKS=0;

INSERT INTO dept_manager VALUES ('111534','d099',date_format(sysdate(),'%y-%m-%d'),'9999-01-01');

 * mysql://root:***@localhost/employees
0 rows affected.
1 rows affected.

[]

In [44]:
%%sql
SELECT *
FROM salaries
WHERE emp_no = '111534'

 * mysql://root:***@localhost/employees
16 rows affected.

[(111534, 48077, datetime.date(1988, 1, 31), datetime.date(1989, 1, 30)),
 (111534, 51718, datetime.date(1989, 1, 30), datetime.date(1990, 1, 30)),
 (111534, 52484, datetime.date(1990, 1, 30), datetime.date(1991, 1, 30)),
 (111534, 55619, datetime.date(1991, 1, 30), datetime.date(1992, 1, 30)),
 (111534, 59574, datetime.date(1992, 1, 30), datetime.date(1993, 1, 29)),
 (111534, 62784, datetime.date(1993, 1, 29), datetime.date(1994, 1, 29)),
 (111534, 63875, datetime.date(1994, 1, 29), datetime.date(1995, 1, 29)),
 (111534, 66978, datetime.date(1995, 1, 29), datetime.date(1996, 1, 29)),
 (111534, 70649, datetime.date(1996, 1, 29), datetime.date(1997, 1, 28)),
 (111534, 71234, datetime.date(1997, 1, 28), datetime.date(1998, 1, 28)),
 (111534, 73020, datetime.date(1998, 1, 28), datetime.date(1999, 1, 28)),
 (111534, 76352, datetime.date(1999, 1, 28), datetime.date(2000, 1, 28)),
 (111534, 78032, datetime.date(2000, 1, 28), datetime.date(2001, 1, 27)),
 (111534, 78961, datetime.date(2001, 1, 27), datetime.date(2002, 1, 27)),
 (111534, 79393, datetime.date(2002, 1, 27), datetime.date(2024, 3, 4)),
 (111534, 81393, datetime.date(2024, 3, 4), datetime.date(9999, 1, 1))]

In [45]:
#trigger exercise 4
#Create a trigger that checks if the hire date of an employee is higher than the current date. If true, set this date to be the current date.
#Format the output appropriately (YY-MM-DD).

In [48]:
%%sql
CREATE TRIGGER check_hire_date
BEFORE INSERT ON employees
FOR EACH ROW
BEGIN
IF NEW.hire_date > date_format(sysdate(), '%Y-%m-%d') THEN
	SET NEW.hire_date = date_format(sysdate(),'%y-%m-%d');
END IF;
END;

 * mysql://root:***@localhost/employees
(MySQLdb.OperationalError) (1359, 'Trigger already exists')
[SQL: CREATE TRIGGER check_hire_date
BEFORE INSERT ON employees
FOR EACH ROW
BEGIN
IF NEW.hire_date > date_format(sysdate(), '%%Y-%%m-%%d') THEN
	SET NEW.hire_date = date_format(sysdate(),'%%y-%%m-%%d');
END IF;
END;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [52]:
%%sql
INSERT employees VALUES ('999905', '1976-01-31', 'John', 'Johnson', 'M', '2025-01-01');  

SELECT  
    *  
FROM  
    employees
WHERE emp_no = '999905';

 * mysql://root:***@localhost/employees
1 rows affected.
1 rows affected.

[(999905, datetime.date(1976, 1, 31), 'John', 'Johnson', 'M', datetime.date(2024, 3, 4))]

In [ ]:
#MySQL CASE Statement exercise 1， check if is manager or not

In [55]:
%%sql
SELECT e.emp_no,e.first_name,e.last_name,
    CASE 
        WHEN dm.emp_no IS NOT NULL THEN 'Manager'
        ELSE 'Employee'
    END AS is_manager
FROM employees e
LEFT JOIN
    dept_manager dm ON e.emp_no = dm.emp_no
WHERE e.emp_no = '109991';

 * mysql://root:***@localhost/employees
1 rows affected.

[(109991, 'Jinxi', 'Reistad', 'Employee')]

In [58]:
#MySQL CASE Statement exercise 2
#Extract a dataset containing the following information about the manager 110420: employee number, first name, and last name. 
#Add two columns at the end – one showing the difference between the maximum and minimum salary of that employee, 
#and another one saying whether this salary raise was higher than $30,000 or NOT.

In [62]:
%%sql
SELECT e.emp_no,e.first_name,e.last_name,
    MAX(s.salary)-MIN(s.salary) AS salary_difference,
    CASE 
        WHEN MAX(s.salary)-MIN(s.salary) > 30000 THEN 'this salary raise was higher than $30,000'
        ELSE 'this salary raise was NOT higher than $30,000'
    END AS salary_raise
FROM dept_manager dm
JOIN employees e ON e.emp_no = dm.emp_no
JOIN salaries s ON s.emp_no = e.emp_no
WHERE e.emp_no = '110420';

 * mysql://root:***@localhost/employees
1 rows affected.

[(110420, 'Oscar', 'Ghazalie', 16654, 'this salary raise was NOT higher than $30,000')]

In [63]:
#Extract the employee number, first name, and last name of the first 10 employees, 
#and add a fourth column, called “current_employee” saying “Is still employed” if the employee is still working in the company, 
#or “Not an employee anymore” if they aren’t.

In [67]:
%%sql
SELECT e.emp_no,e.first_name,e.last_name,
    CASE 
        WHEN MAX(de.to_date) < SYSDATE() THEN 'Not an employee anymore'
        ELSE 'The employee is still working in the company'
    END AS current_employee
FROM dept_emp de
JOIN employees e ON e.emp_no = de.emp_no
GROUP BY de.emp_no
LIMIT 10;

 * mysql://root:***@localhost/employees
10 rows affected.

[(10001, 'Georgi', 'Facello', 'The employee is still working in the company'),
 (10002, 'Bezalel', 'Simmel', 'The employee is still working in the company'),
 (10003, 'Parto', 'Bamford', 'The employee is still working in the company'),
 (10004, 'Chirstian', 'Koblick', 'The employee is still working in the company'),
 (10005, 'Kyoichi', 'Maliniak', 'The employee is still working in the company'),
 (10006, 'Anneke', 'Preusig', 'The employee is still working in the company'),
 (10007, 'Tzvetan', 'Zielinski', 'The employee is still working in the company'),
 (10008, 'Saniya', 'Kalloufi', 'Not an employee anymore'),
 (10009, 'Sumant', 'Peac', 'The employee is still working in the company'),
 (10010, 'Duangkaew', 'Piveteau', 'The employee is still working in the company')]